{
  "2026-02-14": "We depart for our flight to Málaga via Lisbon.",
  "2026-02-15": "Arrival in Málaga and transfer to our hotel the Ocean House Costa del Sol.",
  "2026-02-16": "At leisure to relax and get acquainted with the hotel and fellow travellers.",
  "2026-02-17": "On this half-day coastal tour, we will visit Spain's most exclusive resort area, with 27km of beaches, villas, hotels and golf courses. The focal point is a luxury marina and shopping complex, which welcomes some of the largest and most luxurious private ships in the world.",
  "2026-02-18": "At leisure to enjoy the sun and the lively boardwalk along the Mediterranean Sea.",
  "2026-02-19": "Day at leisure. Your Tour Manager will be on hand to offer suggestions.",
  "2026-02-20": "We will enjoy a full-day tour to Málaga, the ancient port city often called 'the City of Paradise' for its perfect blend of rich history, vibrant culture, sun-kissed beaches, and sparkling blue seas. Highlights include a visit to the Gibralfaro, the historic Moorish fortress offering breathtaking views over the city and coastline, Málaga's magnificent cathedral, and explore Picasso's life and art at the Picasso Museum. The day is rounded off with a special tapas lunch, featuring a delicious selection of traditional small plates.",
  "2026-02-21": "<p><b>An optional excursion to Alfarnate and Alfarnatejo will be offered.</b> Cost 95 Euros per person.</p> <p>Travel to the Andalusian countryside as you explore local customs and traditions on this Spanish adventure. Savor a variety of authentic Andalusian dishes, from hot chocolate and churros and enjoy a meal with a local family in their home. In the nearby whitewashed village of Alfarnate, you will gain another insight into local cuisine by touring an olive grove.</p><p><i>Approximate travel time by bus: 60 mins</i></p>",
  "2026-02-22": "A day at leisure to relax and explore at your own pace.",
  "2026-02-23": "Day at leisure. Your Tour Manager will be on hand to offer suggestions.",
  "2026-02-24": "We will visit the colourful Fuengirola Street Market, where hundreds of vendors have everything from antique maps to gemstones to clothing for sale -- with bargains galore! From there, we'll head to the picturesque village of Mijas to explore its whitewashed streets and ancient buildings, with a stop at a local bar for a tasting of wine and a tapas.<p><i>Approximate travel time by bus: 30 mins</i></p>",
  "2026-02-25": "We will travel along the Costa del Sol to the unique British territory of Gibraltar, located on Spain's southern coast with views across to Africa. Enjoy a panoramic guided tour, exploring key sights and learning about the area's fascinating history. Spot the famous wild Barbary monkeys -- but please observe from a distance and avoid touching or feeding them. After the tour, enjoy free time for lunch and shopping along Main Street, known for its duty-free bargains.",
  "2026-02-26": "At leisure to relax and enjoy the amenities of our hotel.",
  "2026-02-27": "<p><b>A full-day optional excursion will be available to experience unique culinary delights and flavors.</b> Cost 99 Euros per person.</p> Discover the heart of local tradition on this immersive tour to Molino La Paca and Juanito Orange, two iconic sites, that showcase the region's heritage, craftmanship, and rural lifestyle. Visitors can observe and understand the olive oil production process and visit the beautiful Finca Juanito Orange, an ecological orange grove where you'll learn about the organic production of oranges, lemons, and grapefruits.",
  "2026-02-28": "Time at leisure to enjoy the destination.",
  "2026-03-01": "Day at leisure. Your Tour Manager will be on hand to offer suggestions.",
  "2026-03-02": "We will experience the magnificence of La Alhambra, Spain's most iconic monument. Perched on the red hill above Granada, this spectacular fortress was once the summer palace of Moorish royalty and offers a stunning blend of history, architecture, and breathtaking views. We also visit the serene Generalife Palace, once the sultans' summer retreat, and stroll through the enchanting Generalife Gardens. A panoramic tour of Granada reveals its rich Moorish and Christian heritage, including the Madraza (Islamic university), the Alcaicería market, Corral del Carbon, the majestic Renaissance Cathedral, and the elegant Royal Chapel. Lunch at a local restaurant is included.",
  "2026-03-03": "Free day to explore at your own pace.",
  "2026-03-04": "<p><b>An optional full-day excursion to Carrantraca will be offered.</b> Cost 99 Euros per person.</p> Discover rural Málaga on a full-day tour blending nature, tradition, and local flavors, starting with a visit to Finca Solkmark. Continue to the charming village of Carratraca for a leisurely walk through its quaint streets as you uncover the cultural heritage and stories that define this hidden gem, followed by a traditional lunch at a local restaurant",
  "2026-03-05": "Day at leisure.",
  "2026-03-06": "<p><b>An optional full-day excursion to Cordoba will be offered.</b> Cost 108 Euros per person.</p> This thousand-year-old city, designated a World Heritage site, is a living legacy of the diverse cultures that have settled here throughout its history. As we walk through the old quarter, you will discover a beautiful network of alleyways, squares and whitewashed courtyards surrounding the Great Mosque-Cathedral, which reflects the importance of the city in the Middle Ages and is the symbol of the city's unique cultural identity.",
  "2026-03-07": "<p><b>An optional full-day excursion to Seville will be offered.</b> Cost 125 Euros per person.</p> A city beaming with beauty and exuberance every bit as intense as the bright Andalusian sun shining upon it. Seville in one of Spain's cosmopolitan gems. Olive groves sprawling across rolling hills unite soaring mountain ranges with the lapping waters of the Mediterranean Sea.",
  "2026-03-08": "Daily at leisure to relax and enjoy the amenities of our hotel.",
  "2026-03-09": "Day at leisure.",
  "2026-03-10": "We will enjoy a full-day tour of the magnificent prehistoric caves known as the 'Underground Cathedral'. Famed for their huge, dramatic stalactites and stalagmites -- including the largest stalactite in the world -- they are home to some of the oldest art known to humankind. We will also visit Frigiliana to explore its historic quarter, one of the best-preserved Moorish settlements in Spain. We will walk its winding streets, learn its history, and take in some truly spectacular views of the Costa del Sol.",
  "2026-03-11": "Day at leisure. Your Tour Manager will be on hand to offer suggestions.",
  "2026-03-12": "<p>Today we travel to Ronda for a guided tour of its historic old town, including landmarks like the Puerta de Almocabar, and the famous Maestranza Bullring -- birthplace of traditional bullfighting.</p> In the afternoon, visit the unique village of Setenil de las Bodegas, known for its striking cave houses built into the cliffs.",
  "2026-03-13": "A day to relax and explore at your own pace.",
  "2026-03-14": "Final day at leisure to enjoy the destination.",
  "2026-03-15": "<p>We transfer to Málaga Airport for our return flight home.</p> Please wear name tag so that Tour Manager can identity you."}
